In [8]:
import pandas as pd

salary_df = pd.read_csv('../../data/Data Science Job Salary dataset/datascience_salaries.csv')

salary_df.head()

,Unnamed: 0,job_title,job_type,experience_level,location,salary_currency,salary
0,0,Data scientist,Full Time,Senior,New York City,USD,149000
1,2,Data scientist,Full Time,Senior,Boston,USD,120000
2,3,Data scientist,Full Time,Senior,London,USD,68000
3,4,Data scientist,Full Time,Senior,Boston,USD,120000
4,5,Data scientist,Full Time,Senior,New York City,USD,149000

In [9]:
from sklearn.preprocessing import MinMaxScaler

scaler = MinMaxScaler()

salary_df['salary_normalized'] = scaler.fit_transform(salary_df[['salary']])

salary_df.head()

,Unnamed: 0,job_title,job_type,experience_level,location,salary_currency,salary,salary_normalized
0,0,Data scientist,Full Time,Senior,New York City,USD,149000,0.601010
1,2,Data scientist,Full Time,Senior,Boston,USD,120000,0.454545
2,3,Data scientist,Full Time,Senior,London,USD,68000,0.191919
3,4,Data scientist,Full Time,Senior,Boston,USD,120000,0.454545
4,5,Data scientist,Full Time,Senior,New York City,USD,149000,0.601010

In [10]:
from sklearn.decomposition import PCA

numeric_cols = salary_df.select_dtypes(include=['float64', 'int64']).columns
numeric_data = salary_df[numeric_cols]

pca = PCA(n_components=2)
principal_components = pca.fit_transform(numeric_data)

salary_df['PC1'] = principal_components[:, 0]
salary_df['PC2'] = principal_components[:, 1]

salary_df.head()

,Unnamed: 0,job_title,job_type,experience_level,location,salary_currency,salary,salary_normalized,PC1,PC2
0,0,Data scientist,Full Time,Senior,New York City,USD,149000,0.601010,84163.766081,-949.193183
1,2,Data scientist,Full Time,Senior,Boston,USD,120000,0.454545,55163.767131,-941.138351
2,3,Data scientist,Full Time,Senior,London,USD,68000,0.191919,3163.768472,-929.281412
3,4,Data scientist,Full Time,Senior,Boston,USD,120000,0.454545,55163.767548,-939.138352
4,5,Data scientist,Full Time,Senior,New York City,USD,149000,0.601010,84163.767125,-944.193183

In [12]:
grouped_salary = salary_df.groupby('experience_level')['salary'].agg(['mean', 'median']).reset_index()

print(grouped_salary)

  experience_level          mean   median
0            Entry  36111.111111  30000.0
1        Executive  76076.923077  46000.0
2              Mid  51786.885246  51000.0
3           Senior  75088.033012  68000.0